app/views/songs/show.html.erb

  <%#= @song.genres.collect(&:name).to_sentence %>
  <%= @song.genres.collect{|g| g.name}.to_sentence %>
---
SELECT "genres".* FROM "genres" INNER JOIN "song_genres" ON "genres"."id" = "song_genres"."genre_id" WHERE "song_genres"."song_id" = ?  [["song_id", 4]]