app/controllers/songs_controller.rb

INSERT INTO "songs" ("artist_id", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["artist_id", 1], ["created_at", Tue, 05 Nov 2013 21:13:00 UTC +00:00], ["name", "The Suburbs"], ["updated_at", Tue, 05 Nov 2013 21:13:00 UTC +00:00]]
---
  def create
    # params
    # {
    #   :song => {
    #     :name => "Song Name",
    #     :genre_names => "c,s,v,genres",
    #     :artist_name => "Test",
    #   }
    # }
    @song = Song.new(song_params)

    respond_to do |format|
      if @song.save

UPDATE "songs" SET "artist_id" = ?, "updated_at" = ? WHERE "songs"."id" = 1  [["artist_id", 2], ["updated_at", Tue, 05 Nov 2013 21:46:07 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @song.update(song_params)